<?php
//if..else
//if..elseif..else
//全部都可以嵌套使用
//判断逻辑：只要满足给出的条件那么就会执行大括号中的代码
//可以把大括号理解成一个单独写代码的地方

//练习：
//相亲网站注册要求，必须达到试婚年龄才有注册资格
//判断是否达到适婚年龄
//男试婚年龄25
//女适婚年龄23

//用户输入
$people='boy';
 $age=28;
//写一个逻辑，判断用户是否具备注册资格
if($people=='boy'){
	if ($age>=25) {
		echo "该男生已达到适婚年龄";
	}
	else{
		echo "该男生未达到适婚年龄";
	}
}else{
	if ($age>=23) {
		echo "该女生已达到适婚年龄";
	}
	else{
		echo "该女生未达到适婚年龄";
	}
}
//--------------------------------------
if ($people=='boy' && $age>=25) {
	echo "该男生已达到适婚年龄";
}elseif ($people=='girl' && $age>=23) {
	echo "该女生已达到适婚年龄";
}else{
	echo "未达到试婚年龄";
}

?>