<?php
//5文钱可以买一只公鸡，3文钱可以买一只母鸡，一文钱可以买三只雏鸡，现在用100文钱买100只鸡，那么各有公鸡、母鸡、雏鸡多少只？
// for ($a=0; $a <= 100; $a++) { 
// 	for ($b=0; $b <=100; $b++) { 
// 		for ($c=0; $c <=100 ; $c++) { 
// 			if ($a+$b+$c==100 && 5*$a+3*$b+$c/3==100) {
// 				echo "公鸡"."$a"."只";
// 				echo "母鸡"."$b"."只";
// 				echo "雏鸡"."100-$a-$b"."只";
// 				echo "<br>";
// 			}
// 		}
// 	}
// }

//全买公鸡
for ($g=0; $g <=20 ; $g++) {
//全买母鸡 
	for ($m=0; $m <=33 ; $m++) { 
		//全买雏鸡
		for ($c=0; $c <=300 ; $c++) {
		//满足条件，1.鸡的价钱2.鸡的数量 
			if ($g*5+$m*3+$c/3==100 && $g+$m+$c==100) {
				echo "公鸡$g";
				echo "母鸡$m";
				echo "雏鸡$c";
				echo "<hr>";
			}
		}
	}
}

?>